import { ការឆ្លើយតប } from "../helpers/response.js";
import { ទិន្នន័យអ្នកប្រើប្រាស់ទាំងអស់ } from "../models/users.js";

const response = new ការឆ្លើយតប()

export const អ្នកប្រើប្រាស់ទាំងអស់ = async (ការស្នើបន្ថែម) =>
{
    let ច្រើនបំផុត = ការស្នើបន្ថែម.limit || ការស្នើបន្ថែម.ច្រើនបំផុត || 20;
    const ទំព័រ = ការស្នើបន្ថែម.page || ការស្នើបន្ថែម.ទំព័រ || 1;
    const លម្អិត = ការស្នើបន្ថែម.id || ការស្នើបន្ថែម.លម្អិត || null;
    const ស្វែងរក = ការស្នើបន្ថែម.search || ការស្នើបន្ថែម.ស្វែងរក || null;
    const តម្រៀបតាម = ការស្នើបន្ថែម.sort || ការស្នើបន្ថែម.តម្រៀបតាម || "asc";

    if (!Number(ច្រើនបំផុត)) {
        ច្រើនបំផុត = null
    }

    /**
     * ទាញព័ត៌មានរបស់អ្នកប្រើប្រាស់ទាំងអស់តាមរយៈការកំណត់
     * { ច្រើនបំផុត|limit, ទំព័រ|page, លម្អិត|id, ស្វែងរក|search, តម្រៀបតាម|sort }
    */
    const ទិន្នន័យ = await ទិន្នន័យអ្នកប្រើប្រាស់ទាំងអស់({
        ទំព័រ:ទំព័រ,
        ច្រើនបំផុត:ច្រើនបំផុត,
        ស្វែងរក:ស្វែងរក,
        តម្រៀបតាម:តម្រៀបតាម,
        លម្អិត:លម្អិត
    });


    if (!លម្អិត) {
        /**
         * បង្ហាញព័ត៌មានរបស់អ្នកប្រើប្រាស់ទាំងអស់តាមរយៈការកំណត់
         * { ច្រើនបំផុត|limit, ទំព័រ|page, ស្វែងរក|search, តម្រៀបតាម|sort }
        */
        return response.ជោគជ័យ(
            ទិន្នន័យ.ទិន្នន័យ,
            ទិន្នន័យ.ចំនួន,
            ទិន្នន័យ.បង្ហាញ,
            ការស្នើបន្ថែម
        );
    }

    /**
     * បង្ហាញព័ត៌មានលម្អិតរបស់អ្នកប្រើប្រាស់តាមរយៈ {លម្អិត|id}
    */
    return response.ជោគជ័យលម្អិត(
        ទិន្នន័យ.ទិន្នន័យ,
        { id: លម្អិត }
    );
};
